// "© Copyright 2004-2013, 2015-2016 HP Development Company, L.P."

TaskName = "Network Settings";
HSDTaskName = "Network Settings";

ApplySettingsErrorHostNameFailed = "Failed to set Host Name. Check if format is valid.";
AddressInUseError = "The specified IP address is already in use.";
AddressInUseErrorExplanation = "Please specify another IP address.";
IncorrectMaskErrorExplanation = "Incorrect subnet mask specified. Please contact your network administrator for help.";

IncorrectHostNameError = "The length of Host Name is too long.";
IncorrectIpAddressError = "Incorrect IP address format.";
ManualAddressEmptyError = "\"IP Address\" field cannot be empty.";
ManualAddressEmptyExplanation = "Please specify valid IP Address.";
ManualAddressWithPrefixExplanation = "Please specify valid IP Address and prefix length between 1 to 128.";
ManualAddressNotIPv4Explanation = "The IP address must not be IPv4-compatible nor IPv4-mapped.";

STATELESS = "Router";

ipV4TabName = "IPv4";
ipV6TabName = "IPv6";
OtherTabName = "Other Settings";

kCheckChangesAlertTitleKey = "You have changed data. Do you want to continue?";
kCheckChangesAlertContinueButtonTitleKey = "Continue";
kCheckChangesAlertCancelButtonTitleKey = "Cancel";
kCheckChangesAlertMessageKey = "If you continue, you will lose your changes. Click Cancel to discard your action and continue work with task.";

TaskNameTiger = "Bonjour Settings";
NoService = "Service not available";
NoBonjourName = "Not available";

1ServiceName = "Port 9100";
2ServiceName = "IPP";
3ServiceName = "LPD-RAW";
4ServiceName = "LPD-TEXT";
5ServiceName = "LPD-AUTO";
6ServiceName = "LPD-BINPS";
7ServiceName = "LPD-Queue5";
8ServiceName = "LPD-Queue6";
9ServiceName = "LPD-Queue7";
10ServiceName = "LPD-Queue8";
11ServiceName = "LPD-Queue9";
12ServiceName = "LPD-Queue10";
13ServiceName = "LPD";
16ServiceName = "IPPS";

IPPSecureServiceName = "IPP (only secure)";
IPPUnsecureServiceName = "IPP (only unsecure)";

IncorrectConfigurationTitle = "The specified configuration is not correct";
IncorrectConfigurationExplanation = "Please select correct configuration or contact your network administrator for help.";

IncorrectDNSServerErrorExplanation = "Please enter correct DNS Server address or contact your network administrator for help.";
IncorrectGatewayAddressTitle = "The specified gateway address is not correct";
IncorrectGatewayErrorExplanation = "Please enter correct gateway address or contact your network administrator for help.";
GatewayIsNotInSubnetTitle = "Gateway address you entered is not in this device's subnet";
GatewayIsNotInSubnetExplanation = "Please enter another IP address, subnet mask, or gateway address or contact your network administrator for help.";

AskSaveChangesAlertTitle = "You have changed settings on this screen";
AskSaveChangesAlertMsg = "Do you want to apply changes before closing it?";
AskSaveChangesDontApplyButtonTitle = "Don't Apply";
AskSaveCahngesApplyButtonTitle = "Apply";

TaskPanelOKButtonTitle = "OK";

EmptyBonjourServiceNameFieldTitle = "\"Bonjour Service Name\" field cannot be empty";
EmptyBonjourServiceNameFieldMsg = "Specify Bonjour Service Name.";
EmptyBonjourDomainNameFieldTitle = "\"Bonjour Domain Name\" field cannot be empty";
EmptyIPv6DomainNameFieldTitle = "\"IPv6 Domain\" field cannot be empty";
EmptyBonjourDomainNameFieldMsg = "Specify Bonjour Domain Name.";
EmptyBonjourServiceAndDomainNamesFieldTitle = "\"Bonjour Service Name/Domain Name\" fields cannot be empty";
EmptyBonjourServiceAndDomainNamesFieldMsg = "Specify Bonjour Service Name/Domain Name.";
UsedServiceNameTitle = "The specified Bonjour Service Name is already in use.";
UsedServiceNameMsg = "Please specify another Bonjour Service Name or contact your network administrator for help.";
HSDBonjourDomainNameTitle = "Bonjour Domain Name:";

// layout
HSDIPv4Title = "IPv4 Settings";
HSDIPvXDisableNotAvailableDescription = "Both IPv4 and IPv6 can't be disabled simultaneously.";
HSDEnableIPv4InPrinterTitle = "Enable IPv4 in Printer";
HSDConfigTitle = "Configuration:";
HSDNameTitle = "Host Name:";
HSDAddressTitle = "IP Address:";
HSDMaskTitle = "Subnet Mask:";
HSDGatewayTitle = "Default Gateway:";
ManualTitle = "Manual";
Auto = "Automatic";

HSDAdditionalSettingsTitle = "Additional Network Settings";
HSDAdditionalSettingsDescription = "Click Additional Network Settings to get to the printer's embedded web server Network Settings page. There you can configure SNMP, 802.1X and other network settings.";
HSDAdditionalSettingsButton = "Additional Network Settings";

BonjourSettingsTitle = "Bonjour Settings";
HSDEnableBonjourTitle = "Enable Bonjour";
HSDBonjourServiceNameTitle = "Bonjour Service Name:";
HSDPriorityTitle = "The Highest Priority Service:";
HSDAccessTitle = "Access your device at URL:";

PreviousValueString = "Previous value will be applied";

HSDEnableIPv6InPrinterTitle = "Enable IPv6 in Printer";
HSDDHCPv6PolicyTitle = "DHCPv6 Policy:";
HSDIPv6DomainTitle = "IPv6 Domain:";
HSDPrimaryDNSServerTitle = "Primary DNS Server:";
HSDSecondaryDNSServerTitle = "Secondary DNS Server:";
HSDPrefixLengthTitle = "Prefix Length:";
HSDAdditionalAddressesButton = "Additional Addresses";
HSDPolicyPopUpItem1 = "Always perform DHCPv6 on the startup";
HSDPolicyPopUpItem2 = "Perform DHCPv6 when stateless configuration is unsuccessful";
HSDPolicyPopUpItem3 = "Perform DHCPv6 only when requested by the router";

HSDColumnConfigBy = "Config By";
HSDColumnAddresses = "Address";
HSDColumnPrefix = "Prefix Length";
HSDCloseButton = "Close";

HSDApplyButton = "Apply Now";

LINK_LOCAL = "Link-local";
HSDNotAvailableLabel = "Network Settings task is not currently available.\nPlease make sure that device is connected to a network.";
